Writing to a text file:

In [1]:
with open('accounts.txt', mode = 'w') as accounts:
    accounts.write('100 Jones 24.98\n')
    accounts.write('200 Doe 345.67\n')
    accounts.write('300 White 0.00\n')
    accounts.write('400 Stone -42.16\n')
    accounts.write('500 Rich 224.62\n')

In [2]:
with open ('grades.txt', mode = 'w') as grades:
    grades.write('1 Red A\n')
    grades.write('2 Green B\n')
    grades.write('3 White A\n')

Reading data from a text file:

In [3]:
with open ('accounts.txt', mode = 'r') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    for record in accounts:
        account, name, balance = record.split()
        print(f'{account:<10}{name:<10}{balance:<10}')

Account   Name         Balance
100       Jones     24.98
200       Doe       345.67
300       White     0.00
400       Stone     -42.16
500       Rich      224.62

In [4]:
with open ('grades.txt', mode = 'r') as grades:
    print(f'{"ID":<4}{"Name":<7}{"Grade"}')
    for record in grades:
        student_id, name, grade = record.split()
        print(f'{student_id:<4}{name:<7}{grade}')

ID  Name   Grade
1   Red    A
2   Green  B
3   White  A

Updating a file:

In [5]:
accounts = open('accounts.txt', 'r')
temp_file = open('temp_file.txt', 'w')

In [6]:
with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if account != '300':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Williams', balance])
            temp_file.write(new_record + '\n')

Removing a file:

In [7]:
import os
os.remove('accounts.txt')

In [8]:
os.rename('temp_file.txt', 'accounts.txt')

Another Example:

In [9]:
accounts = open('accounts.txt', 'r')
temp_file = open('temp_file.txt', 'w')
with accounts, temp_file:
    for record in accounts:
        account, name, balance = record.split()
        if name != 'Doe':
            temp_file.write(record)
        else:
            new_record = ' '.join([account, 'Smith', balance])
            temp_file.write(new_record + '\n')

In [10]:
import os
os.remove('accounts.txt')
os.rename('temp_file.txt', 'accounts.txt')

JSON Practice:

In [11]:
accounts_dict = {'accounts': [
    {'account': 100, 'name': 'Jones', 'balance': 24.98},
    {'account':200, 'name': 'Doe', 'balance': 345.67}]}

In [12]:
import json 
with open('accounts.json', 'w') as accounts:
    json.dump(accounts_dict, accounts)

Displaying the JSON contents:

In [13]:
with open('accounts.json', 'r') as accounts:
    accounts_json = json.load(accounts)
accounts_json

{'accounts': [{'account': 100, 'name': 'Jones', 'balance': 24.98},
  {'account': 200, 'name': 'Doe', 'balance': 345.67}]}

In [14]:
accounts_json['accounts']

[{'account': 100, 'name': 'Jones', 'balance': 24.98},
 {'account': 200, 'name': 'Doe', 'balance': 345.67}]

Finding a specific JSON index:

In [15]:
accounts_json['accounts'][0]

{'account': 100, 'name': 'Jones', 'balance': 24.98}

"Pretty" JSON printing

In [16]:
with open ('accounts.json', 'r') as accounts:
    print(json.dumps(json.load(accounts), indent = 4))

{
    "accounts": [
        {
            "account": 100,
            "name": "Jones",
            "balance": 24.98
        },
        {
            "account": 200,
            "name": "Doe",
            "balance": 345.67
        }
    ]
}

In [17]:
import json 
grades_dict = {'gradebook':
        [{'student_id': 1, 'name': 'Red', 'grade': 'A'},
         {'student_id': 2, 'name' : 'Green', 'grade': 'B'},
         {'student_id': 3, 'name' : 'White', 'grade': 'A'}]}

In [18]:
with open('grades.json', 'w') as grades:
    json.dump(grades_dict, grades)

In [19]:
with open('grades.json', 'r') as grades:
    print(json.dumps(json.load(grades), indent = 4))

{
    "gradebook": [
        {
            "student_id": 1,
            "name": "Red",
            "grade": "A"
        },
        {
            "student_id": 2,
            "name": "Green",
            "grade": "B"
        },
        {
            "student_id": 3,
            "name": "White",
            "grade": "A"
        }
    ]
}

Exceptions in a try statement:

In [20]:
while True: 
    try: 
        number1 = int(input('Enter numerator: '))
        number2 = int(input('Enter denominator: '))
        result = number1/number2
    except ValueError:
        print('You must enter two integers\n')
    except ZeroDivisionError: 
        print('Attempted to divide by zero\n')
    else:
        print(f'{number1:.3f} / {number2:.3f} = {result:.3f}')
        break

Enter numerator:  7
Enter denominator:  8

7.000 / 8.000 = 0.875

In [21]:
def try_it(value):
    try:
        x = int(value)
    except ValueError:
        print(f'{value} could not be converted to an integer')
    else:
        print(f'int({value}) is {int(value)}')

In [22]:
try_it(10.7)

int(10.7) is 10

Try suite and finally statement

In [23]:
try:
    print('try suite that raises an exception')
    int('hello')
    print('this will not execute')
except ValueError:
    print('a ValueError occured')
else:
    print('else will not execute because an exception occured')
finally:
    print('finally always executes')

try suite that raises an exception
a ValueError occured
finally always executes

In [24]:
def try_it(value):
    try:
        x = int(value)
    except ValueError:
        print(f'{value} could not be converted to an integer')
    else:
        print(f'int({value}) is {int(value)}')
    finally:
        print('Finally executed')

In [25]:
try_it('Python')

Python could not be converted to an integer
Finally executed

CSV Files practice:

In [26]:
import csv
with open ('accounts.csv', mode = 'w', newline = '') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100, 'Jones', 24.96])
    writer.writerow([200, 'Doe', 345.67])
    writer.writerow([300, 'White', 0.00])
    writer.writerow([400, 'Stone', -42.16])
    writer.writerow([500, 'Rich', 224.62])

In [27]:
with open('accounts.csv', 'r', newline='') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    reader = csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.96
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

Reading the Titanic Disaster Dataset

In [29]:
import pandas as pd
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

In [33]:
titanic.head()

                        Unnamed: 0 survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st

In [37]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [38]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']
titanic.head()

                              name survived     sex      age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2     Allison, Miss. Helen Loraine       no  female   2.0000   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st

In [39]:
titanic.describe()

               age
count  1046.000000
mean     29.881135
std      14.413500
min       0.166700
25%      21.000000
50%      28.000000
75%      39.000000
max      80.000000

In [40]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [45]:
histogram = titanic.hist()